#+title: C OPERATORS - PRACTICE
#+AUTHOR: [yourName] (pledged)
#+startup: overview hideblocks indent
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :comments both
* TODO Caveat: i < j < k

1) In C, the expression ~i < j < k~ is perfectly legal but it does
   NOT check if ~j~ is between ~i~ and ~k~:
   - The relational operator ~<~ is evaluated from the left. First the
     Boolean value of ~i < j~ is computed. It is either 0 or 1.
   - Next, the check ~0 < k~ or ~1 < k~ is performed. The following
     example shows how this can go wrong. Run it for illustration.

   #+name: caveat
   #+begin_src C :results output :exports both
     int i = 5, j = 1, k = 100;
     if (i < j < k) {
       printf("TRUE: %d < %d < %d\n", i, j, k);
      } else {
       printf("NOT TRUE: %d < %d < %d\n", i, j, k);
      }
   #+end_src

   #+RESULTS: caveat
   : TRUE: 5 < 1 < 100

3) Fix the the code [[caveat1]] so that the output is correct. Test it for
   different values of i, j, k.

   #+name: caveat1
   #+begin_src C :results output :exports both
     int i = 5, j = 1, k = 100;
     if ( ??? ) {
       printf("TRUE: %d < %d < %d\n", i, j, k);
      } else {
       printf("NOT TRUE: %d < %d < %d\n", i, j, k);
      }
   #+end_src

